public class ExamScore {
    public static void main(String[] args) {
        // ตัวอย่าง int[] scores = {72, 91, 65, 88, 79};
        int[] scores = {72, 91, 65, 88, 79};

        // ข้อ2. ตัวแปรนับจำนวนครั้งของการเปรียบเทียบ
        int compare = 0;
        // ข้อ3. ตัวแปรนับจำนวนครั้งของการสลับข้อมูล
        int swap = 0;

        // ข้อ1. ใช้อัลกอริทึม Bubble Sort
        for (int i = 0; i < scores.length - 1; i++) {
            // (งานเพิ่มเติม) เพิ่มตัวแปร swapped
            boolean swapped = false;

            for (int j = 0; j < scores.length - 1 - i; j++) {
                // ข้อ2. นับจำนวนครั้งของการเปรียบเทียบ
                compare++;

                // เรียงจากมากไปน้อย
                if (scores[j] < scores[j + 1]) {

                    int temp = scores[j];
                    scores[j] = scores[j + 1];
                    scores[j + 1] = temp;
                    // ข้อ3. นับจำนวนครั้งของการสลับข้อมูล
                    swap++;

                    // (งานเพิ่มเติม) เมื่อมีการสลับ ให้กำหนดเป็น true
                    swapped = true;
                }
            }
            // (งานเพิ่มเติม) หากไม่มีการสลับในรอบนี้ ให้หยุดการทำงาน
            if (!swapped) {
                break;
            }
        }

        System.out.println("---ระบบจัดอันดับคะแนนสอบ---");
        System.out.print("คะแนนหลังเรียงลำดับ : ");

        for (int score : scores) {
            System.out.print(score + " ");
        }

        System.out.println();
        System.out.println("จำนวนครั้งที่เปรียบเทียบ : " + compare);
        System.out.println("จำนวนครั้งที่สลับข้อมูล : " + swap);
    }
}



//กรณีศึกษาที่ 4: ระบบจัดอันดับคะแนนสอบ 
// อาจารย์ต้องการเรียงคะแนนจากมากไปน้อย โดยไม่ใช้เมธอดสำเร็จรูป เช่น Arrays.sort() 
// ตัวอย่าง int[] scores = {72, 91, 65, 88, 79}; 
// งานที่มอบหมาย ออกแบบอัลกอริทึมเรียงลำดับ เช่น Bubble Sort หรือ Selection Sort 
// 1. เขียนโปรแกรมภาษา Java 
// 2. นับจำนวนครั้งของการเปรียบเทียบ 
// 3. นับจำนวนครั้งของการสลับข้อมูล 
// 4. วิเคราะห์กรณีข้อมูลเรียงแล้ว 
// 5. วิเคราะห์กรณีข้อมูลเรียงย้อนกลับ 
// งานเพิ่มเติม 
// ปรับปรุง Bubble Sort โดยเพิ่มตัวแปร swapped เพื่อให้หยุดก่อนกำหนดได้ หากไม่มีการสลับข้อมูลในรอบนั้น 
// คำถามวิเคราะห์ 
// 1. Bubble Sort แบบปกติกับแบบปรับปรุงมี Best Case ต่างกันอย่างไร 
// 2. Worst Case ของทั้งสองวิธีต่างกันหรือไม่ 
// 3. หากมีข้อมูลจำนวน 100,000 ค่า ควรเลือกวิธีนี้หรือไม่